# FieldBuilder Constructor (Field, SchemaBuilder) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldBuilder Constructor (Field, SchemaBuilder)
FieldBuilder Class See Also
---
Constructs a new FieldBuilder using the field and associated SchemaBuilder object.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FieldBuilder(
	Field field,
	SchemaBuilder builder
)
```

Visual Basic
---
```text
Public Sub New ( _
	field As Field, _
	builder As SchemaBuilder _
)
```

Visual C++
---
```text
public:
FieldBuilder(
	Field^ field,
	SchemaBuilder^ builder
)
```

# ### Parameters
field
    Type: Autodesk.Revit.DB.ExtensibleStorage..::..Field
builder
    Type: Autodesk.Revit.DB.ExtensibleStorage..::..SchemaBuilder
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FieldBuilder Class
FieldBuilder Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace